ErpTest/src/Enums/ГруппировкиЗатратВЗаказеПереработчику/ГруппировкиЗатратВЗаказеПереработчику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГруппировкиЗатратВЗаказеПереработчику</name>
  <enumValues>
    <name>БезГруппировки</name>
  </enumValues>
  <enumValues>
    <name>ПоПродукции</name>
  </enumValues>
  <enumValues>
    <name>ПоСпецификациям</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаказамНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПоЭтапамПроизводства</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/CommonModules/ПереработкаНаСторонеКлиентСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Переработка на стороне".
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция НомерГруппыЗатратВОтчетеПереработчика(Объект, СтрокаПродукция) Экспорт
	
	НомерГруппыЗатрат = 0;
	
	Если Объект.ПоЗаказам Тогда
		
		ИмяПоляГруппаЗатрат = ИмяПоляГруппаЗатратВОтчетеПереработчика(Объект);
	
		// Если отчет по заказу то группы затрат могут быть только из заказа
		// Если группа только одна то сразу подставим ее в текущую строку продукции.
		Если Объект.Услуги.Количество() = 1 Тогда
			НомерГруппыЗатрат = Объект.Услуги[0][ИмяПоляГруппаЗатрат];
		КонецЕсли; 
		
	Иначе
		
		// Если отчет не по заказу то заполнение группы аналогично заполнению в заказе переработчику.
		Если Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции") Тогда
			
			СтруктураПоиска = Новый Структура("Номенклатура,Характеристика,Назначение,ДокументПоступления");
			СтруктураПоиска.Номенклатура        = СтрокаПродукция.Номенклатура;
			СтруктураПоиска.Характеристика      = СтрокаПродукция.Характеристика;
			СтруктураПоиска.Назначение          = СтрокаПродукция.Назначение;
			СтруктураПоиска.ДокументПоступления = СтрокаПродукция.ДокументПоступления;
			
			СписокСтрок = Объект.Продукция.НайтиСтроки(СтруктураПоиска);
			
			Для каждого ДанныеСтроки Из СписокСтрок Цикл
				Если ДанныеСтроки.НомерГруппыЗатрат <> 0 Тогда
					НомерГруппыЗатрат = ДанныеСтроки.НомерГруппыЗатрат;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НомерГруппыЗатрат = 0 Тогда
				Объект.МаксимальныйНомерГруппыЗатрат = Объект.МаксимальныйНомерГруппыЗатрат + 1;
				НомерГруппыЗатрат = Объект.МаксимальныйНомерГруппыЗатрат;
			КонецЕсли;
			
		ИначеЕсли Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоСпецификациям") Тогда
			
			СтруктураПоиска = Новый Структура("Спецификация", СтрокаПродукция.Спецификация);
			СписокСтрок = Объект.Продукция.НайтиСтроки(СтруктураПоиска);
			Для каждого ДанныеСтроки Из СписокСтрок Цикл
				Если ДанныеСтроки.НомерГруппыЗатрат <> 0 Тогда
					НомерГруппыЗатрат = ДанныеСтроки.НомерГруппыЗатрат;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НомерГруппыЗатрат = 0 Тогда
				Объект.МаксимальныйНомерГруппыЗатрат = Объект.МаксимальныйНомерГруппыЗатрат + 1;
				НомерГруппыЗатрат = Объект.МаксимальныйНомерГруппыЗатрат;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 

	Возврат НомерГруппыЗатрат;
	
КонецФункции

Функция ЗаголовокПоляГруппыЗатрат(ГруппировкаЗатрат, ОбосабливатьПоНазначениюПродукции) Экспорт
	
	Если ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции") Тогда
		
		Если ОбосабливатьПоНазначениюПродукции Тогда
			ЗаголовокГруппы = НСтр("ru = 'Продукция и назначение'");
		Иначе
			ЗаголовокГруппы = НСтр("ru = 'Продукция'");
		КонецЕсли;
		
	ИначеЕсли ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоСпецификациям") Тогда
		
		ЗаголовокГруппы = НСтр("ru = 'Спецификация продукции'");
		
	ИначеЕсли ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЗаказамНаПроизводство") Тогда
		
		ЗаголовокГруппы = НСтр("ru = 'Заказ (этап, спецификация)'");
		
	ИначеЕсли ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства") Тогда
		
		ЗаголовокГруппы = НСтр("ru = 'Этап производства'");
		
	КонецЕсли;
	
	Возврат ЗаголовокГруппы;
	
КонецФункции

Функция ИмяПоляГруппаЗатратВОтчетеПереработчика(Объект) Экспорт
	
	Если Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства") Тогда
		Возврат "ЭтапПроизводства";
	Иначе
		Возврат "НомерГруппыЗатрат";
	КонецЕсли;
	
КонецФункции

Функция ИмяПоляГруппаЗатратВЗаказеПереработчику(Объект) Экспорт
	
	Если Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства") Тогда
		Возврат "Распоряжение";
	Иначе
		Возврат "НомерГруппыЗатрат";
	КонецЕсли;
	
КонецФункции

#КонецОбласти
